#### ExportLineweightInfo Members

---

|  |
| --- |
| ExportLineweightInfo Class   Constructors   Methods   Properties   See Also |

The  ExportLineweightInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLineweightInfo | Constructs a new default ExportLineweightInfo. |
| Public method | ExportLineweightInfo(String) | Constructs a new ExportLineweightInfo using the destination line weight name as input. |
| Public method | ExportLineweightInfo(ExportLineweightInfo) | Constructs a new copy of the input ExportLineweightInfo object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportLineweightInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DestinationLineweightName | The destination lineweight name (the name of the line weight in the exported format) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExportLineweightInfo Class

Autodesk.Revit.DB Namespace